Revit 2024 API
BuiltInFailures.FilledRegionFailures.BadViewType Property
 [Filled Region Name] can't be placed in 3D Views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BadViewType { get; }
Visual Basic
Public Shared ReadOnly Property BadViewType As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BadViewType {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FilledRegionFailures Class
Autodesk.Revit.DB Namespace